<a href="#"><img  height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></a> 

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 15</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario15 will be created
  + resource "aws_security_group" "Scenario15" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario15"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Rule with ICMP protocol "
        }
      + tags_all               = {
          + "Name" = "SG with Rule with ICMP protocol "
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 15\tmp\Scenario 15.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 15\\tmp\\Scenario 15.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 16</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario16 will be created
  + resource "aws_security_group" "Scenario16" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-5728062a",
                ]
              + self             = false
              + to_port          = 22
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario16"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Rule with SG in source "
        }
      + tags_all               = {
          + "Name" = "SG with Rule with SG in source "
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 16\tmp\Scenario 16.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 16\\tmp\\Scenario 16.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @similAlgo<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD